SensorsIot/gplug-mini/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# Measured, not assumed: esptool flash_id on the board reports XMC 20/4016,
# 4MB embedded. ESP-IDF's default for this target is 2MB, which left half the
# flash unaddressable and no room for two OTA partitions (OD-4).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Two app slots, so an OTA never overwrites the running image (FR-OTA-04).
# The layout is FSD Appendix C and is fixed at the first flash — the device is
# in a meter cabinet and there is no USB access afterwards.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Frees GPIO20/21 and keeps a second log stream off the meter UART.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Native USB serial/JTAG is the only console on this board.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_GPLUG_SIM_METER=n

# dlms_parser walks the AXDR structure recursively, and the default 3584-byte
# main task stack is not enough: the first telegram faults with
# "Guru Meditation Error: Core 0 panic'ed (Stack protection fault)".
# The firmware logs its remaining headroom after each cycle so this stays a
# measured number rather than a guess.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Radio at 15 dBm rather than the 20 dBm default — a third of the transmit
# power, and roughly that much less peak current when the PHY comes up.
#
# Measured 2026-08-06: the board reset 3-7 times a minute, every reset an
# ESP_RST_BROWNOUT, and the detector message cut into the phy_init log line as
# it printed — the supply collapsed at the moment the RF front end powered on.
# The brownout detector is at level 7, the least sensitive setting the C3 has
# (~2.5 V), so this was a real collapse and not a twitchy threshold.
#
# This lowers the current the supply has to deliver; it does not fix a supply
# that cannot deliver it. The rail should still be measured on a known-good
# source — if a board browns out at 20 dBm it is marginal at 15, and a meter
# cabinet is a worse place to discover that than a bench. 15 dBm still leaves
# ample margin for a domestic access point a few metres away.
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=15
